[

 {

    "title":"คอมพิวเตอร์คืออะไร",
    "subtitle":"คอมพิวเตอร์ คือ อุปกรณ์ที่ใช้สำหรับคำนวณและทำงานอื่นๆ",
    "imageUrl":"https://cdn.pixabay.com/photo/2017/10/10/21/47/laptop-2838921_960_720.jpg",
    "detail":"คอมพิวเตอร์ (อังกฤษ: computer) หรือศัพท์บัญญัติราชบัณฑิตยสภาว่า คณิตกรณ์[2][3] เป็นเครื่องจักรแบบสั่งการได้ที่ออกแบบมาเพื่อดำเนินการกับลำดับตัวดำเนินการทางตรรกศาสตร์หรือคณิตศาสตร์ โดยอนุกรมนี้อาจเปลี่ยนแปลงได้เมื่อพร้อม ส่งผลให้คอมพิวเตอร์สามารถแก้ปัญหาได้มากมาย\n\nคอมพิวเตอร์ถูกประดิษฐ์ออกมาให้ประกอบไปด้วยความจำรูปแบบต่าง ๆ เพื่อเก็บข้อมูล อย่างน้อยหนึ่งส่วนที่มีหน้าที่ดำเนินการคำนวณเกี่ยวกับตัวดำเนินการทางตรรกศาสตร์ และตัวดำเนินการทางคณิตศาสตร์ และส่วนควบคุมที่ใช้เปลี่ยนแปลงลำดับของตัวดำเนินการโดยยึดสารสนเทศที่ถูกเก็บไว้เป็นหลัก อุปกรณ์เหล่านี้จะยอมให้นำเข้าข้อมูลจากแหล่งภายนอก และส่งผลจากการคำนวณตัวดำเนินการออกไป"

 }, 
 
 {

    "title":"Flutter",
    "subtitle":"Tools สำหรับออกแบบ UI ของ Google",
    "imageUrl":"https://res.cloudinary.com/lima-bean/image/upload/c_scale,dpr_auto,q_auto:best,w_auto/v12/uploads/blogs/flutter-app-development-o4s-zj4.jpg",
    "detail":"ฟลัตเตอร์(Flutter) เป็นเฟรมเวิร์กส่วนติดต่อผู้ใช้ที่โอเพนซอร์ส ที่สร้างโดยกูเกิล สามารถใช้สร้างแอปพลิเคชันได้แบบข้ามแพลตฟอร์มจากฐานโค้ดเดี่ยว (single codebase) ไปทำงานบน เว็บเบราว์เซอร์,[4] แอนดรอยด์ (ระบบปฏิบัติการ), ไอโอเอส, กูเกิล ฟิวเชีย, เว็บเบราว์เซอร์, ลินุกซ์, แมคโอเอส (รวมไปถึง แอปเปิลซิลิคอน) และ ไมโครซอฟท์ วินโดวส์ได้. มีการกล่าวถึงตั้งแต่ปี 2558,[5][6] และมีการเปิดตัวเวอร์ชันแรกของฟลัตเตอร์ในปี 2560"

 },

 {

   "title":"pythonคืออะไร",
   "subtitle":"ภาษาเขียนโปรแกรมชนิดหนึ่ง สร้างเมื่อ 1991",
   "imageUrl":"https://cdn.pixabay.com/photo/2017/10/10/21/47/laptop-2838921_960_720.jpg",
   "detail":"ไพทอน (อังกฤษ: Python) เป็นอินเทอร์พรีเตอร์ภาษาระดับสูงซึ่งสร้างโดยคีโด ฟัน โรสซึม โดยเริ่มใน พ.ศ. 2533 การออกแบบของภาษาไพทอนมุ่งเน้นให้ผู้โปรแกรมสามารถอ่านชุดคำสั่งได้โดยง่ายผ่านการใช้งานอักขระเว้นว่าง (whitespaces) จำนวนมาก นอกจากนั้นการออกแบบภาษาไพทอนและการประยุกต์ใช้แนวคิดการเขียนโปรแกรมเชิงวัตถุในตัวภาษายังช่วยให้นักเขียนโปรแกรมสามารถเขียนโปรแกรมที่เป็นระเบียบ อ่านง่าย มีขนาดเล็ก และง่ายต่อการบำรุง[4]\n\nไพทอนเป็นภาษาแบบไดนามิกพร้อมตัวเก็บขยะ ไพทอนรองรับกระบวนทัศน์การเขียนโปรแกรมหลายรูปแบบ ซึ่งรวมถึงแต่ไม่จำกัดเพียงการเขียนโปรแกรมตามลำดับขั้น การเขียนโปรแกรมเชิงวัตถุ หรือการเขียนโปรแกรมเชิงฟังก์ชัน นอกจากนี้ไพทอนเป็นภาษาที่มักถูกอธิบายว่าเป็นภาษาโปรแกรมแบบ (มาพร้อมถ่าน) (batteries included) กล่าวคือไพทอนมาพร้อมกับไลบรารีมาตรฐานจำนวนมาก เช่นโครงสร้างข้อมูลแบบซับซ้อน และไลบรารีสำหรับคณิตศาสตร์"

}

,

 {

   "title":"Dart คืออะไร",
   "subtitle":"ภาษาเขียนโปรแกรมชนิดหนึ่ง สร้างเมื่อ 1991",
   "imageUrl":"https://cdn.pixabay.com/photo/2017/10/10/21/47/laptop-2838921_960_720.jpg",
   "detail":"ไพทอน (อังกฤษ: Python) เป็นอินเทอร์พรีเตอร์ภาษาระดับสูงซึ่งสร้างโดยคีโด ฟัน โรสซึม โดยเริ่มใน พ.ศ. 2533 การออกแบบของภาษาไพทอนมุ่งเน้นให้ผู้โปรแกรมสามารถอ่านชุดคำสั่งได้โดยง่ายผ่านการใช้งานอักขระเว้นว่าง (whitespaces) จำนวนมาก นอกจากนั้นการออกแบบภาษาไพทอนและการประยุกต์ใช้แนวคิดการเขียนโปรแกรมเชิงวัตถุในตัวภาษายังช่วยให้นักเขียนโปรแกรมสามารถเขียนโปรแกรมที่เป็นระเบียบ อ่านง่าย มีขนาดเล็ก และง่ายต่อการบำรุง[4]\n\nไพทอนเป็นภาษาแบบไดนามิกพร้อมตัวเก็บขยะ ไพทอนรองรับกระบวนทัศน์การเขียนโปรแกรมหลายรูปแบบ ซึ่งรวมถึงแต่ไม่จำกัดเพียงการเขียนโปรแกรมตามลำดับขั้น การเขียนโปรแกรมเชิงวัตถุ หรือการเขียนโปรแกรมเชิงฟังก์ชัน นอกจากนี้ไพทอนเป็นภาษาที่มักถูกอธิบายว่าเป็นภาษาโปรแกรมแบบ (มาพร้อมถ่าน) (batteries included) กล่าวคือไพทอนมาพร้อมกับไลบรารีมาตรฐานจำนวนมาก เช่นโครงสร้างข้อมูลแบบซับซ้อน และไลบรารีสำหรับคณิตศาสตร์"

}


]



